Revit 2024 API
WorksharingDisplaySettings.SetGraphicOverrides Method (CheckoutStatus, WorksharingDisplayGraphicSettings)
 Sets the graphic overrides assigned to elements with a particular ownership status.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void SetGraphicOverrides(
	CheckoutStatus status,
	WorksharingDisplayGraphicSettings overrides
)
Visual Basic
Public Sub SetGraphicOverrides ( _
	status As CheckoutStatus, _
	overrides As WorksharingDisplayGraphicSettings _
)
Visual C++
public:
void SetGraphicOverrides(
	CheckoutStatus status,
	WorksharingDisplayGraphicSettings^ overrides
)
Parameters
status
Type: Autodesk.Revit.DB.CheckoutStatus
 The ownership status of interest.
overrides
Type: Autodesk.Revit.DB.WorksharingDisplayGraphicSettings
 The desired graphic overrides for this ownership status.
Examples
CopyC#
public void SetWorksharingDisplaySettings(Document doc, WorksetId worksetId, String userName)
{
    String message = String.Empty;
    // get or create a WorksharingDisplaySettings current active document
    WorksharingDisplaySettings displaySettings = WorksharingDisplaySettings.GetOrCreateWorksharingDisplaySettings(doc);
    // set a new graphicSettings for CheckoutStatus - NotOwned
    WorksharingDisplayGraphicSettings graphicSettings = new WorksharingDisplayGraphicSettings(true, new Color(255, 0, 0));
    displaySettings.SetGraphicOverrides(CheckoutStatus.NotOwned, graphicSettings);
    // set a new graphicSettings for ModelUpdatesStatus - CurrentWithCentral
    graphicSettings = new WorksharingDisplayGraphicSettings(true, new Color(128, 128, 0));
    displaySettings.SetGraphicOverrides(ModelUpdatesStatus.CurrentWithCentral, graphicSettings);
    // set a new graphicSettings by a given userName
    graphicSettings = new WorksharingDisplayGraphicSettings(true, new Color(0, 255, 0));
    displaySettings.SetGraphicOverrides(userName, graphicSettings);
    // set a new graphicSettings by a given workset Id
    graphicSettings = new WorksharingDisplayGraphicSettings(true, new Color(0, 0, 255));
    displaySettings.SetGraphicOverrides(worksetId, graphicSettings);
}
CopyVB.NET
Public Sub SetWorksharingDisplaySettings(doc As Document, worksetId As WorksetId, userName As [String])
    Dim message As [String] = [String].Empty
    ' get or create a WorksharingDisplaySettings current active document
    Dim displaySettings As WorksharingDisplaySettings = WorksharingDisplaySettings.GetOrCreateWorksharingDisplaySettings(doc)
    ' set a new graphicSettings for CheckoutStatus - NotOwned
    Dim graphicSettings As New WorksharingDisplayGraphicSettings(True, New Color(255, 0, 0))
    displaySettings.SetGraphicOverrides(CheckoutStatus.NotOwned, graphicSettings)
    ' set a new graphicSettings for ModelUpdatesStatus - CurrentWithCentral
    graphicSettings = New WorksharingDisplayGraphicSettings(True, New Color(128, 128, 0))
    displaySettings.SetGraphicOverrides(ModelUpdatesStatus.CurrentWithCentral, graphicSettings)
    ' set a new graphicSettings by a given userName
    graphicSettings = New WorksharingDisplayGraphicSettings(True, New Color(0, 255, 0))
    displaySettings.SetGraphicOverrides(userName, graphicSettings)
    ' set a new graphicSettings by a given workset Id
    graphicSettings = New WorksharingDisplayGraphicSettings(True, New Color(0, 0, 255))
    displaySettings.SetGraphicOverrides(worksetId, graphicSettings)
End Sub
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
WorksharingDisplaySettings Class
SetGraphicOverrides Overload
Autodesk.Revit.DB Namespace